#+TITLE: MG2
#+DATE: 
#+AUTHOR: the author
#+EMAIL: the email
#+REVEAL_INIT_OPTIONS: width:1200, height:800, transition:'none'
#+REVEAL_ROOT: file:///Users/thibault/thib/reveal.js
#+OPTIONS: toc:1 reveal_single_file:t num:nil 
#+REVEAL_EXTRA_CSS: /Users/thibault/thib/reveal.js/local.css
#+REVEAL_THEME: simple 
# #+REVEAL_HLEVEL: 999 #minimum number of slides in first level
#+OPTIONS: author:nil date:nil email:nil
#+OPTIONS: timestamp:nil
#+OPTIONS: reveal_title_slide:auto 

:Options_R:
#+property: :session *R*
#+property: header-args:R :exports results
#+property: header-args:R :eval never-export
#+property: header-args:R+ :tangle yes
#+property: header-args:R+ :session
#+property: header-args:R+ :results output 
:end:

# clean output
#+begin_src emacs-lisp :exports none
   ;(org-babel-map-src-blocks nil (org-babel-remove-result))
#+end_src

** Frequentist

Planned model.

#+BEGIN_SRC R  :results output   :exports both :tangle yes :session
l.conf <- lmer_alt(conf ~ accuracy_gabor  * congruency * effector * effector_order +  rt_gabor_centered +
		     (1 +  accuracy_gabor  + congruency * effector + effector_order + rt_gabor_centered||subject_id),
		   REML = TRUE,
		   data = data)

summary(l.conf)
#+END_SRC

#+BEGIN_SRC html
boundary (singular) fit: see ?isSingular
Linear mixed model fit by REML. t-tests use Satterthwaite's method ['lmerModLmerTest']
Formula: conf ~ accuracy_gabor * congruency * effector * effector_order +      rt_gabor_centered + (1 + re1.accuracy_gabor1 + re1.congruency1 +  
    re1.effector1 + re1.effector_order1 + re1.rt_gabor_centered +      re1.congruency1_by_effector1 || subject_id)
   Data: data

REML criterion at convergence: 11328.5

Scaled residuals: 
    Min      1Q  Median      3Q     Max 
-3.3254 -0.6412  0.0346  0.7116  3.6482 

Random effects:
 Groups       Name                         Variance Std.Dev.
 subject_id   (Intercept)                  0.245998 0.49598 
 subject_id.1 re1.accuracy_gabor1          0.014271 0.11946 
 subject_id.2 re1.congruency1              0.004089 0.06394 
 subject_id.3 re1.effector1                0.030939 0.17589 
 subject_id.4 re1.effector_order1          0.076411 0.27643 
 subject_id.5 re1.rt_gabor_centered        1.139401 1.06743 
 subject_id.6 re1.congruency1_by_effector1 0.000000 0.00000 
 Residual                                  0.669425 0.81818 
Number of obs: 4510, groups:  subject_id, 24

Fixed effects:
                                                        Estimate Std. Error         df t value Pr(>|t|)    
(Intercept)                                            2.388e+00  1.170e-01  2.209e+01  20.412 7.90e-16 ***
accuracy_gabor1                                        2.378e-01  2.849e-02  2.171e+01   8.349 3.19e-08 ***
congruency1                                           -4.884e-02  1.928e-02  2.732e+01  -2.533   0.0174 *  
effector1                                             -9.566e-03  3.883e-02  2.371e+01  -0.246   0.8075    
effector_order1                                       -1.917e-01  1.170e-01  2.209e+01  -1.638   0.1155    
rt_gabor_centered                                     -1.870e+00  2.337e-01  2.053e+01  -8.001 9.64e-08 ***
accuracy_gabor1:congruency1                            6.330e-03  1.416e-02  4.390e+03   0.447   0.6550    
accuracy_gabor1:effector1                              2.033e-03  1.469e-02  4.371e+03   0.138   0.8899    
congruency1:effector1                                 -1.531e-02  1.413e-02  4.430e+03  -1.084   0.2785    
accuracy_gabor1:effector_order1                        2.323e-02  2.848e-02  2.169e+01   0.816   0.4236    
congruency1:effector_order1                            2.037e-02  1.928e-02  2.731e+01   1.056   0.3001    
effector1:effector_order1                             -5.675e-02  3.883e-02  2.370e+01  -1.461   0.1570    
accuracy_gabor1:congruency1:effector1                  2.523e-02  1.418e-02  4.321e+03   1.779   0.0754 .  
accuracy_gabor1:congruency1:effector_order1           -2.880e-02  1.416e-02  4.390e+03  -2.034   0.0421 *  
accuracy_gabor1:effector1:effector_order1             -1.708e-02  1.469e-02  4.371e+03  -1.163   0.2450    
congruency1:effector1:effector_order1                  9.574e-03  1.413e-02  4.430e+03   0.678   0.4980    
accuracy_gabor1:congruency1:effector1:effector_order1 -5.687e-03  1.418e-02  4.321e+03  -0.401   0.6884    
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

Correlation matrix not shown by default, as p =
12.
Use print(x, correlation=TRUE)  or
    vcov(x)        if you need it

optimizer (nloptwrap) convergence code: 0 (OK)
boundary (singular) fit: see ?isSingular
#+END_SRC

#+REVEAL: split

There is a convergence singularity issue. Let's look at PCA. 

#+BEGIN_SRC R  :results output   :exports both :tangle yes :session
  summary(rePCA(l.conf))
#+END_SRC

#+RESULTS:
: $subject_id
: Importance of components:
:                         [,1]   [,2]    [,3]    [,4]    [,5]    [,6] [,7]
: Standard deviation     1.305 0.6062 0.33785 0.21498 0.14601 0.07815    0
: Proportion of Variance 0.754 0.1628 0.05057 0.02047 0.00944 0.00271    0
: Cumulative Proportion  0.754 0.9168 0.96738 0.98785 0.99729 1.00000    1

We remove congruency. 

#+REVEAL: split

#+BEGIN_SRC R  :results output   :exports both :tangle yes :session
l.conf2 <- lmer_alt(conf ~ accuracy_gabor  * congruency * effector * effector_order +  rt_gabor_centered +
		     (1 +  accuracy_gabor  +  effector + effector_order + rt_gabor_centered||subject_id),
		   REML = TRUE,
		   data = data)
summary(l.conf2)
#+END_SRC

#+BEGIN_SRC R
Warning message:
In checkConv(attr(opt, "derivs"), opt$par, ctrl = control$checkConv,  :
  Model failed to converge with max|grad| = 0.00602653 (tol = 0.002, component 1)
Linear mixed model fit by REML. t-tests use Satterthwaite's method ['lmerModLmerTest']
Formula: conf ~ accuracy_gabor * congruency * effector * effector_order +      rt_gabor_centered + (1 + re1.accuracy_gabor1 + re1.effector1 +  
    re1.effector_order1 + re1.rt_gabor_centered || subject_id)
   Data: data

REML criterion at convergence: 11335.8

Scaled residuals: 
    Min      1Q  Median      3Q     Max 
-3.3096 -0.6418  0.0291  0.7090  3.5165 

Random effects:
 Groups       Name                  Variance Std.Dev.
 subject_id   (Intercept)           0.007361 0.08579 
 subject_id.1 re1.accuracy_gabor1   0.014528 0.12053 
 subject_id.2 re1.effector1         0.031089 0.17632 
 subject_id.3 re1.effector_order1   0.314518 0.56082 
 subject_id.4 re1.rt_gabor_centered 1.138896 1.06719 
 Residual                           0.672988 0.82036 
Number of obs: 4510, groups:  subject_id, 24

Fixed effects:
                                                        Estimate Std. Error         df t value Pr(>|t|)    
(Intercept)                                            2.386e+00  1.169e-01  2.209e+01  20.411 7.95e-16 ***
accuracy_gabor1                                        2.386e-01  2.869e-02  2.175e+01   8.316 3.36e-08 ***
congruency1                                           -4.657e-02  1.419e-02  4.432e+03  -3.281  0.00104 ** 
effector1                                             -1.058e-02  3.892e-02  2.369e+01  -0.272  0.78812    
effector_order1                                       -1.916e-01  1.169e-01  2.209e+01  -1.639  0.11548    
rt_gabor_centered                                     -1.854e+00  2.336e-01  2.051e+01  -7.938 1.10e-07 ***
accuracy_gabor1:congruency1                            5.457e-03  1.411e-02  4.430e+03   0.387  0.69894    
accuracy_gabor1:effector1                              2.729e-03  1.472e-02  4.390e+03   0.185  0.85288    
congruency1:effector1                                 -1.546e-02  1.413e-02  4.430e+03  -1.094  0.27390    
accuracy_gabor1:effector_order1                        2.352e-02  2.868e-02  2.173e+01   0.820  0.42119    
congruency1:effector_order1                            1.911e-02  1.419e-02  4.434e+03   1.347  0.17818    
effector1:effector_order1                             -5.659e-02  3.892e-02  2.369e+01  -1.454  0.15910    
accuracy_gabor1:congruency1:effector1                  2.584e-02  1.409e-02  4.429e+03   1.833  0.06683 .  
accuracy_gabor1:congruency1:effector_order1           -2.761e-02  1.411e-02  4.430e+03  -1.957  0.05043 .  
accuracy_gabor1:effector1:effector_order1             -1.720e-02  1.472e-02  4.389e+03  -1.169  0.24262    
congruency1:effector1:effector_order1                  9.627e-03  1.413e-02  4.430e+03   0.681  0.49576    
accuracy_gabor1:congruency1:effector1:effector_order1 -6.261e-03  1.409e-02  4.429e+03  -0.444  0.65690    
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

Correlation matrix not shown by default, as p =
12.
Use print(x, correlation=TRUE)  or
    vcov(x)        if you need it

optimizer (nloptwrap) convergence code: 0 (OK)
Model failed to converge with max|grad| = 0.00602653 (tol = 0.002, component 1)
#+END_SRC

